// Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

Console.Write("Enter the number of week:  ");
string num = Console.ReadLine();
if (num == "1,2,3,4,5") Console.WriteLine("Weekday- no");
else Console.WriteLine("Day off- yes");


